20220822171457-debug_an_aesara_graph.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-01-07 Sun 20:16 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Debug an Aesara graph (advanced)</title>
<meta name="author" content="Rémi Louf" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="style.css" /></head>
<body>
<div id="content" class="content">
<h1 class="title">Debug an Aesara graph (advanced)</h1>

<div id="outline-container-orgecaf7a6" class="outline-2">
<h2 id="orgecaf7a6">The graph compiles, I get an ugly stack trace!</h2>
<div class="outline-text-2" id="text-orgecaf7a6">
<div class="org-src-container">
<pre class="src src-python">E   <span style="color: #7CB8BB;">IndexError</span>: index out of bounds
E   Apply node that caused the error: Subtensor{int64, ::, int64}(BroadcastTo.0, ScalarConstant{0}, ScalarConstant{39})
E   Toposort index: 492
E   Inputs types: [TensorType(float64, (<span style="color: #BFEBBF;">None</span>, <span style="color: #BFEBBF;">None</span>, <span style="color: #BFEBBF;">None</span>)), ScalarType(int64), ScalarType(int64)]
E   Inputs shapes: [(2401, 2, 2), (), ()]
E   Inputs strides: [(32, 16, 8), (), ()]
E   Inputs values: [<span style="color: #CC9393;">'not shown'</span>, 0, 39]
E   Outputs clients: [[InplaceDimShuffle{x,0}(Subtensor{int64, ::, int64}.0)]]
</pre>
</div>

<ol class="org-ol">
<li>Re-run in a debugger</li>
<li>Go up (<code>u</code>) the stack trace</li>
<li><code>fgraph</code> (the function graph where the error occurs) should be avaible in the name space.</li>
<li>In the error message you should see indications such as <code>Toposort index: 492</code>, and this means that you can access the node via <code>node = fgraph.toposort()[492]</code></li>
<li>You can then inspect the resulting node, and see who created it by inspecting the tag <code>node.tag</code>.</li>
</ol>
</div>
</div>

<div id="outline-container-org075a373" class="outline-2">
<h2 id="org075a373">Clear the cache</h2>
<div class="outline-text-2" id="text-org075a373">
<p>
Sometimes it can be useful to clear the cache manually between different runs
</p>

<div class="org-src-container">
<pre class="src src-bash">aesara-cache clear
</pre>
</div>
</div>
</div>

<div id="outline-container-org451c47d" class="outline-2">
<h2 id="org451c47d">Pretty printing the graph</h2>
<div class="outline-text-2" id="text-org451c47d">
<p>
Aeasara can return at a pretty-printed version of the graph:
</p>

<div class="org-src-container">
<pre class="src src-python">aesara.dprint(fgraph)
</pre>
</div>

<p>
This <code>dprint</code> function has a couple of interesting keyword arguments:
</p>
<ul class="org-ul">
<li><code>print_op_info=True</code> Gives annotation next to the Scan inputs</li>
<li><code>print_type_info=True</code></li>
</ul>
</div>
</div>

<div id="outline-container-org4f3c95e" class="outline-2">
<h2 id="org4f3c95e">Rewrites applied to the graph</h2>
<div class="outline-text-2" id="text-org4f3c95e">
<p>
We can change the Logging properties using a context manager, fun.
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #F0DFAF; font-weight: bold;">with</span> aesara.config.(rewrite_verbose=<span style="color: #BFEBBF;">True</span>):
    Compile
</pre>
</div>
</div>
</div>

<div id="outline-container-org4f781de" class="outline-2">
<h2 id="org4f781de">Disable optimizations</h2>
<div class="outline-text-2" id="text-org4f781de">
<p>
After examining the graph, and how the nodes were created you may suspect that a bug was introduced by a rewrite. The best way to confirm this hypothesis is usually to disable all rewrites at once. And then exclude individual rewrites to narrow it down.
</p>
</div>

<div id="outline-container-org7e54c45" class="outline-3">
<h3 id="org7e54c45">mode=Mode(optimizer="None")</h3>
</div>
<div id="outline-container-orgf4d23b1" class="outline-3">
<h3 id="orgf4d23b1">FAST<sub>RUN.excluding</sub>("&lt;name&gt;")</h3>
</div>
<div id="outline-container-org93511ea" class="outline-3">
<h3 id="org93511ea">If this is the inner-graph of a <code>Scan</code></h3>
<div class="outline-text-3" id="text-org93511ea">
<p>
Inner-graphs in <code>Scan</code> need to ave their set of optimizations set separately. It is then easier to use the global <code>aesara.config</code>. This is better done in <code>conftest.py</code> (the config needs to be updated before Aesara is initialized).
</p>

<div class="org-src-container">
<pre class="src src-python" id="org1b42a31"><span style="color: #F0DFAF; font-weight: bold;">import</span> os

<span style="color: #F0DFAF; font-weight: bold;">def</span> <span style="color: #93E0E3;">pytest_sessionstart</span>(session):
    <span style="color: #DFAF8F;">os.environ</span>[<span style="color: #CC9393;">"AESARA_FLAGS"</span>] = <span style="color: #CC9393;">","</span>.join(
        [
            os.environ.setdefault(<span style="color: #CC9393;">"AESARA_FLAGS"</span>, <span style="color: #CC9393;">""</span>),
            <span style="color: #CC9393;">"warn__ignore_bug_before=all,on_opt_error=raise,on_shape_error=raise,optimizer_excluding=remove_constants_and_unused_inputs"</span>,
        ]
    )
</pre>
</div>

<p>
We're looking for the <code>optimizer_excluding</code> flag.
</p>
</div>
</div>
<div id="outline-container-org8181452" class="outline-3">
<h3 id="org8181452"><span class="todo TODO">TODO</span> Rich for graph folding project</h3>
</div>
<div id="outline-container-orgab96e20" class="outline-3">
<h3 id="orgab96e20"><span class="todo TODO">TODO</span> Add rewrite trajectory to a node's <code>tag</code> in the fully rewritten graph</h3>
<div class="outline-text-3" id="text-orgab96e20">
<p>
Funny, isn't that something that we could easily deduct if the rewrites were described in an e-graph?
</p>
</div>
</div>
</div>

<div id="outline-container-orgbc0c4ac" class="outline-2">
<h2 id="orgbc0c4ac">Profile Aesara code</h2>
<div class="outline-text-2" id="text-orgbc0c4ac">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #5F7F5F;"># </span><span style="color: #7F9F7F;">Enable profiling for compilation of the outer-function</span>
<span style="color: #DFAF8F;">f_doubling</span> = aesara.function([A, B, tol, max_iter], gamma[-1], profile=<span style="color: #BFEBBF;">True</span>)
f_doubling.profile.summary()
</pre>
</div>
</div>
</div>

<div id="outline-container-orgbbab170" class="outline-2">
<h2 id="orgbbab170">Links to this note</h2>
<div class="outline-text-2" id="text-orgbbab170">
<ul class="org-ul">
<li><a href="./20220729163627-aesara.html">Aesara</a></li>
</ul>
</div>
</div>
</div>
</body>
</html>
